package com.github.sergeybrezhnev.bruce.eckel.chapter.four;

/*
 * Вампирами называются числа, состоящие из четного количества цифр и полученные перемножением пары числе, каждое из
 * которых содержит половину цифр результата. Цифры берутся из исходного числа в произвольном порядке, завершающие нули
 * недопустимы
 *
 * 1260 = 21 * 60
 * 1827 = 21 * 87
 * 2187 = 27 * 81
 *
 * Напишите программу, которая находит всех вампиров, состоящих из 4 цифр.
 *
 * Первый вариант перебрать все числа от 1000 до 9999 и перемножить все комбинации. Кажется получится достаточно сложно
 * Второй вариант перебрать все пары чисел от 10 до 99 и перемножить их на такие же пары чисел и затем проверить
 * наличие аналогичных цифр в результате. Возможна проблема повторов цифр.
 */
public class Ten {
}
